export const agreementData = [
    {
        type: 'preface',
        contents: [
            '本协议由你和隐入（杭州）科技有限公司签订。本协议有助于你了解我们为你提供的服务内容及你的权利和义务，请你仔细阅读，对于尤为重要的条款，我们已予以加黑加粗，以特别提醒你加以注意。',
            '为便于你使用来客宝，你通过网络页面点击或以其他形式确认本协议的，即视为你已充分阅读并理解本协议所有条款，并同意与来客宝订立本协议并接受本协议的约束。如果你未满18周岁，请在法定监护的陪同下阅读本协议，并特别关注使用条款。',
            '如你在同意受本协议内容约束之前，对本协议内容存在疑虑或异议，请你联系我们或合作方（15523734540），以便我们或合作方为你进行解释和说明，使你能够充分理解，从而帮助你自主决定是否接受本协议及是否使用我们及指定合作方的服务。'
        ]
    },
    {
        title: '一、定义',
        contents: ['除上下文文义另有所指外，本协议中下列用语具有如下含义：'],
        subSections: [
            {
                title: '1.1 个人信息',
                contents: ['是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。']
            },
            {
                title: '1.2 信息主体',
                contents: ['是指产生个人信息并享有个人信息权利的自然人。']
            },
            {
                title: '1.3 处理',
                contents: ['指以自动化方式或人工方式对个人信息进行的操作，包括输入、存储、编辑、检索、变更、补充、删除以及其他操作，无论此操作是否采用自动化的手段。']
            },
            {
                title: '1.4 使用',
                contents: ['指对个人信息进行目的内使用、披露、公开、二次开发、传输等处理之外的使用。']
            },
            {
                title: '1.5 明示同意',
                contents: ['个人信息主体通过书面声明或主动做出肯定性动作，肯定性动作包括个人信息主体主动勾选、主动点击"同意"、"注册"、"发送"、"拨打"等。']
            },
            {
                title: '1.6 授权',
                contents: ['是指信息主体依照其意愿自愿做出的任何指定的、具体的、知情的及明确的指示。通过声明或明确肯定的行为作出的这种指示，意味着其同意与其有关的个人数据被处理。授权形式包括纸质授权书或电子授权等。']
            },
            {
                title: '1.7 匿名化',
                contents: ['在保证数据来源合法的前提下，使个人数据在不使用额外信息的情况下,不指向特定数据主体对待个人数据处理方式。该处理方式将个人数据与其他额外信息分别存储，并且使个人数据因技术手段而无法指向一个可识别和已识别的自然人。']
            }
        ]
    },
    {
        title: '二、协议范围',
        contents: [
            '2.1 本条款是用户"简称你"与隐入（杭州）科技有限公司（简称：公司）产品之间关于用户使用本产品所订立的协议。"用户"是指注册、登录、使用本产品的个人或组织;"其他用户"是指包括其他公司相关产品用户及使用产品的相关的用户。',
            '2.2 本服务是指产品根据本协议向你提供的服务，包括群发、加人等。我们会不断丰富你使用本服务的终端、形式等，本协议自动适用于你对所有版本的软件和服务的使用。',
            '2.3 提供本服务的产品的所有权和全部的使用权均归公司所有，你开通后仅授权使用部分功能，具体以产品展示的为准。',
            '2.4 本协议内容包括本协议正文及所有我们已经发布或将来可能发布的隐私权政策、各项政策、规则、声明、通知、警示、提示、说明(以下统称为"用户规则")。前述用户规则为本协议不可分割的补充部分，与本协议具有同等法律效力。如你使用公司产品及服务，视为你同意上述补充部分。'
        ]
    },
    {
        title: '三、服务规则',
        contents: ['3.1 服务的内容'],
        subSections: [
            {
                title: '3.1.1',
                contents: ['服务内容是指公司向用户提供的微商辅助工具(以下简称"来客宝")，支持微信的即时通讯服务的基础上，同时为用户提供包括但不限于关系链拓展、便捷工具与其他软件或硬件信息互通等功能或内容的软件许可及服务(以下简称"本服务")。']
            }
        ]
    },
    {
        title: '3.2 服务的形式',
        subSections: [
            {
                title: '3.2.1',
                contents: ['你使用本服务需要下载来客宝软件，对于这些软件，公司给予你一项个人的，不可转让及非排他性的许可。你仅可为访问或使用本服务的目的而使用这些软件及服务。']
            }
        ]
    },
    {
        title: '3.3 本服务许可的范围',
        subSections: [
            {
                title: '3.3.1',
                contents: ['公司给予你一项个人的、不可转让及非排他性的许可，以使用本软件。你可以为商业目的在单一台终端设备上安装、使用、显示、运行本软件。']
            },
            {
                title: '3.3.2',
                contents: ['你可以为使用本软件及服务的目的复制本软件的一个副本，仅用作备份。备份副本必须包含原软件中含有的所有著作权信息。']
            },
            {
                title: '3.3.3',
                contents: ['本条及本协议其他条款未明示授权的其他一切权利仍由公司保留，你在行使这些权利时须另外取得公司的书面许可，公司如果关行使前述任何权利，并不构成对该权利的放弃。']
            }
        ]
    },
    {
        title: '四、软件的更新',
        contents: [
            '4.1 为了改善用户体验、完善服务内容，公司将不断努力开发新的服务，并为你不时提供软件更新(这些更新可能会采取软件替换、修改、功能强化、版本升级等形式)。',
            '4.2 为了保证本软件及服务的安全性和功能的一致性，公司有权不经向你特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。',
            '4.3 本软件新版本发布后，旧版本的软件可能无法使用。公司不保证旧版本软件继续可用及相应的客户服务，请你随时核对并下载最新版本。'
        ]
    },
    {
        title: '五、用户个人信息保护',
        contents: [
            '5.1 保护用户个人信息是公司的一项基本原则，公司将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可公司不会向第三方公开，透露用户个人信息。公司相关信息采取专业加密存储与传输方式，保障用户个人信息的安全。',
            '5.2 你在注册帐号或使用本服务的过程中，需要提供一些必要的信息，例如:为向你提供帐号注册服务或进行用户身份识别，需要你填写手机号码,手机通讯录等功能需更你授权访问手机通讯录等。若国家法律法规或政策有特殊规定的，你需要提供真实的身份信息。若你提供的信息不完整，则无法使用本服务或在使用过程中受到限制。',
            '5.3 一般情况下，你可随时浏览、修改自己提交的信息，但出于安全性和身份识别(如号码申诉服务)的考虑，你可能无法修改注册时提供的初始注册信息及其他验证信息。',
            '5.4 公司将运用各种安全技术和程序建立完善的管理制度来保护你的个人信息，以免遭受未经授权的访问、使用或披露。',
            '5.5 未经你的同意，公司不会向本公司以外的任何公司、组织和个人披露你的个人信息，但法律法规另有规定的除外。',
            '5.6 公司非常重视对未成年人个人信息的保护。若你是18周岁以下的未成年人，在使用公司产品的服务前，应事先取得你家长或法定监护人的书面同意。',
            '5.7 对于来客宝会如何收集、使用、存储和保护你的个人信息及你享有何种权利，你还可以阅读《来客宝隐私政策》予以进一步了解。'
        ]
    },
    {
        title: '六、用户行为规范',
        subSections: [
            {
                title: '6.1 信息内容规范',
                contents: [
                    '6.1.1 本条所述信息内容是指用户使用本软件及服务过程中所制作、复制、发布、传播的任何内容，包括但不限于名字，用户说明等注册信息，或发送的文字，语音，名片，视频，表情等信息，朋友圈各文，视频动态和相关链接页面，以及其他使用产品帐号或本软件及服务所产生的内容。',
                    '6.1.2 你理解并同意，本产品一直致力于为用户提供文明健康，规范有序的网络环境，你不得利用产品帐号或本软件及服务制作、复制、发布、传播如下干扰正常运营，以及侵犯其他用户或第三方合法权益的内容，包括但不限于:'
                ],
                subSections: [
                    {
                        title: '6.1.2.1 发布、传送、传播、储存违反国家法律法规禁止的内容:',
                        contents: [
                            '(1) 违反宪法确定的基本原则的',
                            '(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的',
                            '(3) 损害国家荣誉和利益的',
                            '(4) 煽动民族仇恨、民族歧视，破坏民族团结的',
                            '(5) 破坏国家宗教政策，宣扬邪教和封建迷信的',
                            '(6) 散布谣言，扰乱社会秩序，破坏社会稳定的',
                            '(7) 散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的',
                            '(8) 侮辱或者诽谤他人，侵害他人合法权益的',
                            '(9) 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的',
                            '(10) 以非法民间组织名义活动的',
                            '(11) 不符合《即时通信工具公众信息服务发展管理暂行规定》及遵守法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等"七条底线"要求的',
                            '(12) 含有法律、行政法规禁止的其他内容的'
                        ]
                    },
                    {
                        title: '6.1.2.2',
                        contents: ['发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容']
                    },
                    {
                        title: '6.1.2.3',
                        contents: ['涉及他人隐私、个人信息或资料的']
                    },
                    {
                        title: '6.1.2.4',
                        contents: ['发表、传送、传播骚扰、广告信息、过度营销信息及垃圾信息或含有任何性或性暗示的']
                    },
                    {
                        title: '6.1.2.5',
                        contents: ['其他违反法律法规，政策及公序良俗，社会公德或干扰正常运营和侵犯其他用户或第三方合法权益内容的信息']
                    }
                ]
            },
            {
                title: '6.2 软件使用规范',
                contents: ['除非法律允许或公司书面许可，你使用本软件过程中不得从事下列行为:'],
                subSections: [
                    {
                        title: '6.2.1.1',
                        contents: ['删除本软件及其副本上关于著作权的信息']
                    },
                    {
                        title: '6.2.1.2',
                        contents: ['对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码']
                    },
                    {
                        title: '6.2.1.3',
                        contents: ['对公司拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等']
                    },
                    {
                        title: '6.2.1.4',
                        contents: ['对本软件或有本软件运行过程中释放到终端内存的数据，软件运行的过程中客服端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品']
                    },
                    {
                        title: '6.2.1.5',
                        contents: ['通过修改或伪造软件运行中的指令、数据，增加，删减，变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的']
                    },
                    {
                        title: '6.2.1.6',
                        contents: ['自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰']
                    },
                    {
                        title: '6.2.1.7',
                        contents: ['其他未经公司明示授权的行为']
                    }
                ]
            }
        ]
    },
    {
        title: '七、知识产权声明',
        contents: [
            '7.1 公司是本软件的知识产权权利人。本软件的一切著作权、商标权、专利权、商业秘密等知识产权，以及与本软件相关的所有信息内容(包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等)均受中华人民共和国法律法规和相应的国际条约保护，公司享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。',
            '7.2 未经公司或相关权利人书面同意，你不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。',
            '7.3 你使用本软件及服务过程中上传、发布的全部内容，均不会因为上传、发布行为发生知识产权，肖像权等权利的转移。'
        ]
    },
    {
        title: '八、终端安全责任',
        contents: [
            '8.1 你理解并同意，本软件同大多数互联网软件一样，可能会受多种因素影响，包括但不限于用户原因、网络服务质量、社会环境等;也可能会受各种安全问题的侵扰，包括但不限于他人非法利用用户资料，进行现实中的骚扰;用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁你的终端设备信息和数据安全，继而影响本软件的正常使用等。因此，你应加强信息安全及个人信息的保护意识，注意密码保护以免遭受损失。',
            '8.2 你不得制作、发布、使用、传播用于窃取公司账号及他人个人信息、财产的恶意程序。',
            '8.3 维护软件安全与正常使用是公司和你的共同责任，公司将按照行业标准合理审慎地采取必要技术措施保护你的终端设备信息和数据安全，但是你承认和同意公司并不能就此提供完全保证。',
            '8.4 在任何情况下，你不应轻信借款，索要密码或其他涉及财产的网络信息。'
        ]
    },
    {
        title: '九、其他',
        contents: [
            '9.1 你使用本软件即视为你已阅读并同意受本协议的约束。公司有权在必要时修改本协议条款。你可以在本软件的最新版本中查阅相关协议条款。本协议条款变更后，如果你继续使用本软件，即视为你已接受修改后的协议。如果你不接受修改后的协议，应当停止使用本软件。',
            '9.2 本协议签订地为中华人民共和国浙江省杭州市滨江区。',
            '9.3 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律(不包括冲突法)。',
            '9.4 若你和公司之间发生任何纠纷或争议，首先应友好协商解决;协商不成的，你同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。',
            '9.5 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。',
            '9.6 本协议可能存在包括中文、英文在内的多种语言的版本，如果存在中文版本与其他语言的版本相冲突的地方，以中文版本为准。',
            '9.7 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。'
        ]
    }
]