export const privacyData = [
    {
        type: 'preface',
        contents: [
            '隐私信息是指公民个人生活中不愿为他人公开或知悉的秘密。隐入（杭州）科技有限公司（或称"我们"，指隐入（杭州）科技有限公司及其关联公司，下同）重视用户隐私信息的保护，您在使用隐入（杭州）科技有限公司的"来客宝"（以下简称"本软件"）时，隐入（杭州）科技有限公司可能会收集和使用您的相关信息。隐入（杭州）科技有限公司希望通过本政策向您说明您的哪些信息可能会被收集、收集这些信息的目的、隐入（杭州）科技有限公司及您如何保护这些信息的安全等。',
            '请您在使用本软件前，仔细阅读本政策（尤其是加粗内容）并确认了解我们对您个人信息的处理规则。如您对本隐私政策有任何疑问，可联系我们进行咨询，如您不同意本隐私协议中的任何条款，您应立即停止使用本软件。一旦您点击确认接受本政策或在隐入（杭州）科技有限公司更新本隐私政策后，您继续使用本软件，视为您同意隐入（杭州）科技有限公司按本政策收集、使用、保存、共享、转让或披露您的相关信息。我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠，本政策将帮助您了解以下内容，如您有任何疑问，请告知我们：',
            '个人信息是指能够切实可行地单独或通过与其他信息结合识别特定用户身份的信息或信息集合，包括但不限于姓名、出生日期、身份证件号码、住址、电话号码、账号、密码等。'
        ]
    },
    {
        title: '一、我们如何收集您的个人信息',
        contents: [
            '本政策有关个人信息、个人敏感信息的内容出自于GB/T35273《个人信息安全规范》的规定，定义与GB/T35273《个人信息安全规范》定义一致。'
        ],
        subSections: [
            {
                title: '1.1 为注册账户之目的收集您提供的信息',
                contents: [
                    '（1）为向您提供账户注册及登录功能及服务，您需提供如下信息：',
                    '当您注册账号时，会向我们提供手机号码、登录密码。',
                    '当您使用第三方账号登录时，我们会读取您在第三方账号注册使用的昵称、头像。',
                    '目前本软件支持手机号、微信登录方式，后续注册登录方式如有变化，以本软件实际提供的为准。',
                    '收集前述这些账号信息的目的在于（1）通过账号管理更好地为您提供服务，通过登录账户，您可以同步您账号内所有的数据；在您更换设备后，通过登录账户，可以继续使用您已同步的相关信息，不会因为更换设备而导致数据丢失。（2）如您提供真实有效的手机号码、微信号进行绑定，当您遇到注册账号丢失、忘记密码问题时，可以便捷的找回账号和密码。（3）我们将对所收集的相关信息去标识化后进行统计分析，以便更加准确了解用户的习惯，并在此基础上不断改善产品、提高服务质量及改善产品用户使用体验。',
                    '（2）如您不提供上述信息，不注册账号，将会影响您使用本软件的VIP增值服务等功能。'
                ]
            },
            {
                title: '1.2 在您使用服务过程中获取的信息',
                contents: [
                    '在您使用本软件提供的服务过程中，为了了解产品适配性、识别账号异常状态、向您报送错误等，除了您根据产品或服务内容主动向我们提供的信息外，我们可能会收集您的设备信息，以及您和您的设备如何与我们的产品及服务交互的信息，此类信息包括：',
                    '（1）设备及应用信息。如设备名称、设备识别码（ESN、MEID和SN）、设备激活时间、硬件型号、操作系统版本、应用程序版本、软件识别码、通讯录、短信息、设备及应用设置（如地区/语言/时区/字体）等。',
                    '（2）移动网络信息。如公共陆地移动网络提供商ID（PLMN）、地理位置（设备定位所在区域信号发射塔识别信息）、Internet协议（IP）地址。',
                    '（3）日志信息。当您使用我们的服务或者查看由我们提供的内容时我们或合作方会自动收集某些信息并存储在日志中，如服务的访问时间、访问次数、访问IP、事件信息（如错误、崩溃、重启、升级）等。',
                    '（4）特定功能。当软件服务提供商、智能设备提供商或系统服务提供商与我们联合为你提供服务时，例如认证服务、短息服务等，为实现这一功能，我们可能会收集你的相关设备信息（例如硬件型号、操作系统版本号、国际移动设备身份识别码（IMEI）、网络设备硬件地址（MAC））经过去标识化后并提供给前述提供商。',
                    '（5）您存储在合作方服务器的内容。如您上传到云空间的内容会存储在数据服务提供方服务器，以实现您快速访问和同一内容在不同设备间的共享。我们或合作方不会查看您存储在合作方服务器的内容。我们在中华人民共和国境内收集和产生的个人信息将存储在中华人民共和国境内。'
                ]
            },
            {
                title: '1.3 功能点及其对应权限',
                contents: [
                    '1.获客工具。此功能是本软件的核心功能，本软件使用这些功能需要用到手机悬浮框权限、辅助功能权限和读写存储权限和通讯录读写权限等，如果拒绝开启以上权限，可能会使获客工具使用失败。',
                    '2.微商工具。内含群内加好友、拍照加好友等。使用该功能可能需要相机权限或者相册权限，此功能需要获取相册图片，尝试读取SDcard数据（删除）和尝试写入SDcard数据（创建）。',
                    '3.软件安装列表。我们的软件下需要获取用户"软件安装列表"信息，因为支付以及微信登录需要读取已安装包名列表、获取用户软件安装列表权限（如微信、支付宝）。',
                    '4.其他功能。应用OTA升级更新需要用到应用安装权限，实名认证需要相机权限人脸识别，于一、富贵竹科技第三方SDK数据统计分析需要网络、手机基本信息等权限。七鱼第三方SDK需要拨打电话权限联系客服解决问题。新颜科技SDK进行实名认证需要获取相机权限来进行实名认证。'
                ]
            }
        ]
    },
    {
        title: '二、我们如何使用您的个人信息',
        contents: [
            '为了遵守国家法律法规及监管要求，以及向您提供服务及提升服务质量，或保障您的账户和资金安全，我们会在以达成服务为目的时，在以下情形下使用您的信息：',
            '2.1 我们会根据本隐私政策的约定并为实现我们的产品与/或服务功能对所收集的个人信息进行使用。',
            '2.2 请您了解并同意，我们有权使用去标识化且无法识别您个人身份的个人信息；并在不透露您个人信息的前提下，我们有权对用户数据库进行分析并予以商业化的利用。',
            '2.3 请您注意，您在使用我们的产品与/或服务时所提供的所有个人信息，将在您使用我们的产品与/或服务期间持续授权我们使用。',
            '2.4 我们或合作方会对产品与/或服务使用情况进行统计，并可能会与公众或合作方共享这些统计信息，以展示我们的产品与/或服务的整体使用趋势。但这些统计信息不包含您的任何身份识别信息。',
            '2.5 当我们展示您的个人信息时，我们会采用包括内容替换、匿名处理方式对您的信息进行脱敏，以保护您的信息安全。'
        ]
    },
    {
        title: '三、我们如何共享、转让、公开披露您的个人信息',
        subSections: [
            {
                title: '3.1 共享',
                contents: [
                    '我们不会与隐入（杭州）科技有限公司以外的任何公司、组织和个人分享您的个人信息，但以下情况除外:',
                    '1、在获取明确同意的情况下共享；',
                    '2、根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息；',
                    '3、与我们的附属公司共享：但我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束，如附属公司如要改变个人信息的处理目的，将再次征求您的授权同意；',
                    '4、与授权合作伙伴共享:为丰富服务内容：我们会联合合作伙伴共同向您提供服务,并依据法律法规的强制性规定及/或合作伙伴的要求收集并向合作伙伴共享您的个人信息。我们仅会出于合法、正当必要、特定、明确的目的向合作方共享您的个人信息。如果您拒绝我们向相应合作方共享您的个人信息的，则将导致您无法使用相应服务。'
                ]
            },
            {
                title: '3.2 转让',
                contents: [
                    '是指将个人信息控制权由我们或合作方向另一个个人信息控制者转移的过程。我们及合作方不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：',
                    '在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；',
                    '在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受本声明的约束，否则我们将要求该公司、组织重新向您征求授权同意。'
                ]
            },
            {
                title: '3.3 公开披露',
                contents: [
                    '我们及合作方仅会在以下情况下，公开披露您的个人信息：获得您的明确同意后；基于法律或合理依据的公开披露：在法律、法律程序、诉讼或公共和政府主管部门有要求的情况下，我们可能会公开披露您的信息。'
                ]
            }
        ]
    },
    {
        title: '四、我们如何保护您的个人信息',
        contents: [
            '我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭受到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。我们会部署访问控制机制，确保只有授权人员才可访问个人信息。我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。',
            '在不幸发生个人信息安全事件后，我们将按照法律要求，及时向您告知：安全事件的基本情况和可能的影响、我们已经采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。如果难以逐一进行告知的，我们会采取合理、有效的方式发布公告。同时，我们还会按照监管部门要求，主动上报个人信息安全事件的处置情况。'
        ]
    },
    {
        title: '五、第三方SDK服务说明',
        contents: [
            '我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭受到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。我们会部署访问控制机制，确保只有授权人员才可访问个人信息。我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。'
        ],
        subSections: [
            {
                title: '第三方SDK名称：富贵竹科技SDK',
                contents: [
                    '第三方名称：长沙富贵竹网络科技有限公司',
                    '使用目的：(1)用于用户对产品进行反馈与建议，上传反馈与建议，以及注销账号。(2)用户会员登录信息、支付类型、广告管理等；以及绑定微信号，修改密码，获取验证码等。',
                    '使用场景：软件更新、用户账号绑定手机号、使用G码、隐私数据导出。',
                    '共享方式：SDK本机采集',
                    '涉及的个人信息/权限类型：设备状态及身份信息、用户手机号、存储读写权限、Mac地址、唯一设备识别码（IMEI、androidID/IDFA/OPENUDID /GUID、SIM 卡 IMSI 信息）。'
                ]
            },
            {
                title: '第三方SDK名称：于一SDK（com.hiyuyi）',
                contents: [
                    '第三方名称：隐入（杭州）科技有限公司',
                    '使用目的：(1)用户会员登录信息、支付类型、广告管理等；以及绑定微信号，修改密码，获取验证码等。(2)数据上报与分析。',
                    '使用场景：软件更新、用户账号绑定手机号、使用G码、隐私数据导出。',
                    '共享方式：SDK本机采集',
                    '涉及的个人信息/权限类型：设备状态及身份信息、在"后台状态"下获取ANDROID ID、用户手机号、存储读写权限、Mac地址、唯一设备识别码（IMEI、androidID/IDFA/OPENUDID /GUID、SIM 卡 IMSI 信息）。'
                ]
            },
            {
                title: '第三方SDK名称：微信（登录、支付)SDK',
                contents: [
                    '第三方名称：深圳市腾讯计算机系统有限公司',
                    '使用目的：为了实现用户通过微信账号登录本软件平台，我们会与微信平台共享用户的微信头像、昵称、微信open ID和union ID信息，目的是让用户更安全、便捷地登录本软件，可以选择使用微信第三方账号授权登录本软件，更方便的购买本软件中的付费服务。',
                    '使用场景：用户通过微信账号登录本软件平台时使用',
                    '收集方式：调用系统相关接口自动采集',
                    '涉及个人信息：设备品牌、设备型号、设备名称、设备软件版本信息、设备识别码（AndroidId、MAC、IMEI、IDFA）、设备标识符（OAID）；网络身份标识信息：IP地址（粗略的位置信息）；个人基本资料：微信open_id、union_id（头像、昵称）。'
                ]
            },
            {
                title: '第三方SDK名称：支付宝SDK',
                contents: [
                    '第三方名称：支付宝（杭州）信息技术有限公司',
                    '使用目的：支持用户在应用内使用支付宝支付',
                    '使用场景：支持用户在应用内使用支付宝支付',
                    '收集方式：SDK采集',
                    '涉及个人信息：用户设备信息（IMEI/IMSI、SIM卡序列号/MAC地址、硬件序列号、android_id、ssid/bssid、设备屏幕密度），网络信息（网络类型、当前连接Wi-Fi信息、运营商名称），应用数据（访问外部存储卡）'
                ]
            },
            {
                title: '其他SDK说明',
                contents: [
                    '艾珀科技SDK：用于产品内"我要分享"功能模块，奖金规则的显示网页，用户收益显示网页。以及用于产品内货源模块的网页展示。以上需要调用艾珀科技SDK，此SDK不会收集用户的个人信息。',
                    '百度SDK：产品内"拍照加人"功能点需要使用百度SDK，此SDK用于文字识别功能，不会收集用户的个人信息。',
                    '新颜科技SDK：产品内实名认证功能需要调用此SDK，此SDK用于用户进行实名认证操作，不会收集用户的个人信息。',
                    '于一科技SDK：产品内"微商学院"功能点会调用此SDK，此SDK用于显示"微商学院"网页，不会收集用户的个人信息。'
                ]
            }
        ]
    },
    {
        title: '六、您的权利',
        contents: [
            '按照中国相关的法律、法规、标准以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利。'
        ],
        subSections: [
            {
                title: '6.1 访问或更正您的个人信息',
                contents: [
                    '您有权访问或更正您的个人信息，您可以通过访问或编辑您的账户信息来达到上述目的，如您无法通过上述方法权访问或更正，您可以您可以向我们发送电子邮件，我们将在15天内回复您的请求。'
                ]
            },
            {
                title: '6.2 账户注销',
                contents: [
                    '您随时可注销此前注册的账户，在注销账户之后，我们将停止为您提供产品或服务，并依据您的要求，删除您的个人信息，法律法规另有规定的除外。',
                    '用户账户的注销：您可通过以下路径"我的-注销账号"，向我们提出注销您的已注册账号的请求，我们会立即注销您的账号。当您注销账号后，我们将删除或匿名化处理您的个人信息。'
                ]
            }
        ]
    },
    {
        title: '七、合作方链接及其产品与服务',
        contents: [
            '隐入（杭州）科技有限公司及其合作方的网站、应用软件、产品与服务中可能含有合作方网站、产品与服务的链接。隐入（杭州）科技有限公司的产品和服务也可能使用或提供来自合作方的产品或服务，如各大应用市场内上架的合作方App。',
            '所有含有合作方网站、产品与服务的链接仅为方便用户而提供。本软件及其合作方对此类合作方无控制权，无法对链接内容提供任何明示和暗示的保证，此类链接也不视为本软件对链接内容的授权；本软件亦无法控制合作方的隐私或数据保护政策，此类合作方也不受到本声明的约束。',
            '您需自行独立判断您与此类链接的互动行为，在向合作方提交个人信息之前，请阅读并参考这些合作方的隐私政策，我们及合作方对此不承担任何责任。'
        ]
    },
    {
        title: '八、本政策的变更、联系方式',
        contents: [
            '我们可能适时修订本隐私政策的条款，该等修订构成本隐私政策的一部分。如该等修订会导致您在本隐私政策下权利的实质减损，我们将在修订生效前通过在主页上显著位置提示或向您发送电子邮件或以其他方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的本隐私政策的约束。',
            '如您对本隐私政策有任何疑问，可以通过以下方式联系我们：',
            '公司名称：隐入（杭州）科技有限公司',
            '联系电话：15523734540',
            '一般情况下，我们将在收到您的咨询之日起15个工作日内给予答复。'
        ]
    },
    {
        title: '九、个性化推荐说明',
        contents: [
            '为了向您提供更好的服务和使用体验，我们可能会根据您的使用习惯、浏览历史等信息，通过算法等技术手段提供个性化的商品或服务推荐。',
            '我们承诺：',
            '1. 我们向您推荐商品或服务时，会采用去标识化的方式对您的个人信息进行脱敏处理；',
            '2. 我们不会因为您不同意接受个性化推荐而拒绝提供基本服务；',
            '3. 您有权随时通过"我的-设置-隐私设置"关闭个性化推荐功能。',
            '4. 当您选择关闭个性化推荐功能后，我们将不再基于您的个人特征进行商品或服务的个性化推荐，但我们仍可能向您展示基于您的地理位置、搜索关键词等数据进行的非个性化推荐。',
            '5. 我们会采取严格的技术和管理措施保护您的个人信息安全，防止您的个人信息被泄露、篡改或者丢失。'
        ]
    }
] 